In [1]:
import numpy as np
import pandas as pd

In [6]:
student=pd.read_csv('student.csv')

In [3]:
score=pd.read_csv('score.csv')

In [5]:
df=pd.merge(student,score,on='Student_Id')

In [8]:
student.head()

   Student_Id  Age  Gender Grade Employed
0           1   19    Male     A      yes
1           2   20  Female     B       no
2           3   18    Male     A       no
3           4   21  Female    B+       no
4           5   19    Male    A-       no

In [9]:
score.head()

   Student_Id  Score      City
0           1     95        LA
1           2     70     Miami
2           3     98   Chicago
3           4     75    Boston
4           5     89  New York

In [10]:
df.head()

   Student_Id  Age  Gender Grade Employed  Score      City
0           1   19    Male     A      yes     95        LA
1           2   20  Female     B       no     70     Miami
2           3   18    Male     A       no     98   Chicago
3           4   21  Female    B+       no     75    Boston
4           5   19    Male    A-       no     89  New York